const js_architecture = [
    {
        title: 'Архитектурные паттерны',
        subtitle: '',
        img: '',
        list: [
            'dependency injection',
            'singlton',
            '',
        ],
        link: '',
        text: '',
        code: ``,
    },
    {
        title: 'Dependency Injection',
        subtitle: '',
        img: '',
        link: '',
        text: 'Паттерн при котором каждое вхождение отслеживается програмно. Сколько, чего и как добавляется в наш instance класс. К слову непопулярный патерн, по крайней мере на хабре. Но я его учил по тому как его реализовали в тинькофф',
        code: ``,
    },
    {
        title: 'Dependency Injection',
        subtitle: '',
        img: '',
        link: '',
        text: 'Паттерн при котором каждое вхождение отслеживается програмно. Сколько, чего и как добавляется в наш instance класс. К слову непопулярный патерн, по крайней мере на хабре. Но я его учил по тому как его реализовали в тинькофф',
        code: ``,
    },

]